; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-3degree-100mindistance-4trucks-3packages-541seed

(define (problem transport-two-cities-sequential-5nodes-1000size-3degree-100mindistance-4trucks-3packages-541seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  truck-3 - vehicle
  truck-4 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 479,384 -> 367,5
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 40)
  ; 367,5 -> 479,384
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 40)
  ; 178,555 -> 479,384
  (road city-1-loc-4 city-1-loc-2)
  (= (road-length city-1-loc-4 city-1-loc-2) 35)
  ; 479,384 -> 178,555
  (road city-1-loc-2 city-1-loc-4)
  (= (road-length city-1-loc-2 city-1-loc-4) 35)
  ; 178,555 -> 149,905
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 36)
  ; 149,905 -> 178,555
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 36)
  ; 354,324 -> 367,5
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 32)
  ; 367,5 -> 354,324
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 32)
  ; 354,324 -> 479,384
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 14)
  ; 479,384 -> 354,324
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 14)
  ; 354,324 -> 178,555
  (road city-1-loc-5 city-1-loc-4)
  (= (road-length city-1-loc-5 city-1-loc-4) 29)
  ; 178,555 -> 354,324
  (road city-1-loc-4 city-1-loc-5)
  (= (road-length city-1-loc-4 city-1-loc-5) 29)
  ; 2583,606 -> 2807,936
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 40)
  ; 2807,936 -> 2583,606
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 40)
  ; 2583,606 -> 2410,224
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 42)
  ; 2410,224 -> 2583,606
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 42)
  ; 2728,802 -> 2807,936
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 16)
  ; 2807,936 -> 2728,802
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 16)
  ; 2728,802 -> 2583,606
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 25)
  ; 2583,606 -> 2728,802
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 25)
  ; 2475,371 -> 2410,224
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 17)
  ; 2410,224 -> 2475,371
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 17)
  ; 2475,371 -> 2583,606
  (road city-2-loc-5 city-2-loc-3)
  (= (road-length city-2-loc-5 city-2-loc-3) 26)
  ; 2583,606 -> 2475,371
  (road city-2-loc-3 city-2-loc-5)
  (= (road-length city-2-loc-3 city-2-loc-5) 26)
  ; 2475,371 -> 2728,802
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 50)
  ; 2728,802 -> 2475,371
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 50)
  ; 479,384 <-> 2410,224
  (road city-1-loc-2 city-2-loc-2)
  (= (road-length city-1-loc-2 city-2-loc-2) 194)
  (road city-2-loc-2 city-1-loc-2)
  (= (road-length city-2-loc-2 city-1-loc-2) 194)
  (at package-1 city-1-loc-2)
  (at package-2 city-1-loc-3)
  (at package-3 city-1-loc-1)
  (at truck-1 city-2-loc-4)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-3)
  (at truck-3 city-2-loc-3)
  (capacity truck-3 capacity-4)
  (at truck-4 city-2-loc-3)
  (capacity truck-4 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-4)
  (at package-2 city-2-loc-2)
  (at package-3 city-2-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-2 city-2-loc-2 city-1-loc-2)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 3
2. (pick-up truck-2 city-1-loc-2 package-1 capacity-2 capacity-3)
   deleted: (at package-1 city-1-loc-2) (capacity truck-2 capacity-3)
   added: (in package-1 truck-2) (capacity truck-2 capacity-2)
   goals met: 0 of 3
3. (drive truck-2 city-1-loc-2 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 3
4. (drive truck-2 city-1-loc-4 city-1-loc-3)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-3)
   goals met: 0 of 3
5. (pick-up truck-2 city-1-loc-3 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-1-loc-3) (capacity truck-2 capacity-2)
   added: (in package-2 truck-2) (capacity truck-2 capacity-1)
   goals met: 0 of 3
6. (drive truck-2 city-1-loc-3 city-1-loc-4)
   deleted: (at truck-2 city-1-loc-3)
   added: (at truck-2 city-1-loc-4)
   goals met: 0 of 3
7. (drive truck-2 city-1-loc-4 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-4)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 3
8. (drive truck-2 city-1-loc-2 city-1-loc-1)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-1-loc-1)
   goals met: 0 of 3
9. (pick-up truck-2 city-1-loc-1 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-1-loc-1) (capacity truck-2 capacity-1)
   added: (in package-3 truck-2) (capacity truck-2 capacity-0)
   goals met: 0 of 3
10. (drive truck-2 city-1-loc-1 city-1-loc-2)
   deleted: (at truck-2 city-1-loc-1)
   added: (at truck-2 city-1-loc-2)
   goals met: 0 of 3
11. (drive truck-2 city-1-loc-2 city-2-loc-2)
   deleted: (at truck-2 city-1-loc-2)
   added: (at truck-2 city-2-loc-2)
   goals met: 0 of 3
12. (drop truck-2 city-2-loc-2 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-2) (capacity truck-2 capacity-0)
   added: (at package-2 city-2-loc-2) (capacity truck-2 capacity-1)
   goals met: 1 of 3
13. (drop truck-2 city-2-loc-2 package-3 capacity-1 capacity-2)
   deleted: (in package-3 truck-2) (capacity truck-2 capacity-1)
   added: (at package-3 city-2-loc-2) (capacity truck-2 capacity-2)
   goals met: 2 of 3
14. (drive truck-2 city-2-loc-2 city-2-loc-3)
   deleted: (at truck-2 city-2-loc-2)
   added: (at truck-2 city-2-loc-3)
   goals met: 2 of 3
15. (drive truck-2 city-2-loc-3 city-2-loc-4)
   deleted: (at truck-2 city-2-loc-3)
   added: (at truck-2 city-2-loc-4)
   goals met: 2 of 3
16. (drop truck-2 city-2-loc-4 package-1 capacity-2 capacity-3)
   deleted: (in package-1 truck-2) (capacity truck-2 capacity-2)
   added: (at package-1 city-2-loc-4) (capacity truck-2 capacity-3)
   goals met: 3 of 3
